Revit 2027 API
Reference.ElementReferenceType Property
The type of reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementReferenceType ElementReferenceType { get; }
Public ReadOnly Property ElementReferenceType As ElementReferenceType
	Get
public:
property ElementReferenceType ElementReferenceType {
	ElementReferenceType get ();
}
member ElementReferenceType : ElementReferenceType with get
Property Value
ElementReferenceType
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace